Repository: jhighman/signr
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: es

source: Personal Information
es: Información Personal

source: Full Name
es: Nombre Completo

source: required
es: obligatorio

source: Email
es: Correo Electrónico

source: Phone
es: Teléfono

source: optional
es: opcional

source: Verification Type
es: Tipo de Verificación

source: Employment Verification (single employer)
es: Verificación de Empleo (un solo empleador)

source: Last
es: Últimos

source: Years
es: Años

source: Next: Employment Timeline
es: Siguiente: Cronología de Empleo

source: Step
es: Paso

source: of
es: de

source: This form collects your employment history information. It is divided into multiple steps including personal information, employment timeline,
es: Este formulario recopila información sobre su historial laboral. Se divide en varios pasos que incluyen información personal, cronología de empleo,

source: degree verification,
es: verificación de título,

source: and signature.
es: y firma.

source: Employment Timeline
es: Cronología de Empleo

source: Please provide details about your employment.
es: Por favor, proporcione detalles sobre su empleo.

source: Please account for the last
es: Por favor, tenga en cuenta los últimos

source: years of your employment history, including any gaps.
es: años de su historial laboral, incluidos los períodos sin empleo.

source: Timeline Coverage
es: Cobertura de la Cronología

source: Visual representation of your employment timeline
es: Representación visual de su cronología de empleo

source: Now
es: Ahora

source: Time accounted for:
es: Tiempo contabilizado:

source: years
es: años

source: Your Entries
es: Sus Entradas

source: No entries yet. Add your first employment entry.
es: Aún no hay entradas. Añada su primera entrada de empleo.

source: Previous: Personal Information
es: Anterior: Información Personal

source: Add Employment Entry
es: Añadir Entrada de Empleo

source: Next: Degree Verification
es: Siguiente: Verificación de Título

source: Next: Signature
es: Siguiente: Firma

source: Employment Entry
es: Entrada de Empleo

source: Please provide details for this employment period.
es: Por favor, proporcione detalles para este período de empleo.

source: Back to Timeline
es: Volver a la Cronología

source: Save Entry
es: Guardar Entrada
